

<div style="padding-left: 10px; padding-right: 10px; padding-top: 20px;">
<p >A empresa Adapit foi idealizada como uma refer&ecirc;ncia brasileira de iniciativa privada
 para Pesquisa e Desenvolvimento de Engenharia de Software. Dado que ela &eacute;
 uma spin-off de um mestrado realizado na PUCRS entre 2004 e 2006, os empreendedores
 est&atilde;o aplicando em empresas brasileiras os resultados positivos de suas pesquisas 
 acad&ecirc;micas. Os resultados s&atilde;o publicados desde 2006 e demonstram claramente a colabora&ccedil;&atilde;o
 entre a empresa e a academia. 
  <a href="portal.html?art=1" target="blank">Clique aqui para acessar as publica&ccedil;&otilde;es</a>.</p>

<p >No ano de 2005, decidimos fundar uma empresa focada em P&D e fazer uma integra&ccedil;&atilde;o
 entre a ind&uacute;stria (empresas produtoras de software) e a academia. Temos orgulho de informar
 que trabalhamos durante mais de um ano "na garagem", desenvolvendo o nosso primeiro prot&oacute;tipo
 de ferramenta WCT (Work CASE Toolkit). A empresa foi constitu&iacute;da em agosto de 2007,
 depois de uma resposta positiva da incubadora RAIAR sobre o plano de neg&oacute;cios dos empreendedores. 
 Durante o per&iacute;odo de incuba&ccedil;&atilde;o, de 2007 at&eacute; 2011, realizamos o planejamento e alinhamos
 nossas id&eacute;ias com as necessidades do mercado. Tamb&eacute;m produzimos o sistema WCT e fortalecemos
 os servi&ccedil;os com os nossos parceiros, contando com apoio financeiro do programa da FINEP
 denominado PRIME (Primeira Empresa Inovadora).</p>

 
<p>Focadas em agregar maior valor &agrave;s equipes de produ&ccedil;&atilde;o de software, nossas
 pesquisas priorizam a produ&ccedil;&atilde;o de aplicativos WEB usando da automatiza&ccedil;&atilde;o de
 pequenas tarefas de programa&ccedil;&atilde;o. Nossos servi&ccedil;os buscam a adapta&ccedil;&atilde;o
 do aplicativo WCT para os cen&aacute;rios dos clientes, o que requer muita pesquisa e
 aprimoramento das t&eacute;cnicas de desenvolvimento empregadas nesse aplicativo. Assim,
 para estarmos em constante evolu&ccedil;&atilde;o, precisamos de proximidade com a academia.
</p>

<p>Findado o sistema WCT, os empreendedores foram em busca de novos conhecimentos na &aacute;rea,
 retomando as pesquisas acad&ecirc;micas. Em 2012, iniciaram um doutorado em
 Engenharia de Software, orientados pelo prof. Dr. Toacy Cavalcante Oliveira,
 na Universidade Federal do Rio de Janeiro (UFRJ). A cede da empresa mudou de Porto Alegre - RS
 para Niter&oacute;i - RJ. Os projetos de pesquisa est&atilde;o 
 relacionados com o foco da empresa e s&atilde;o exemplos de mais uma colabora&ccedil;&atilde;o entre
 empresas e a academia:</p>
 <ul>
 <li>Um dos projetos tem o foco o estudo da automa&ccedil;&atilde;o de processos
 de desenvolvimento de software usando <i>tailoring</i> para BPMN e SPEM;</li> 
 <li>O outro tem como foco um
 estudo da automa&ccedil;&atilde;o de processos de reuso de software. Nesse estudo est&aacute; inclusa a WCT, especificamente
 o m&oacute;dulo da abordagem FOMDA, como ferramenta de experimenta&ccedil;&atilde;o e execu&ccedil;&atilde;o dos processos.</li>
</ul>
<br>

</div>