<style>
<!--
 /* Style Definitions */
 p.MsoNormal, li.MsoNormal, div.MsoNormal
	{margin:0cm;
	margin-bottom:.0001pt;
	font-size:10.0pt;
	font-family:Arial;}
	-->
</style>
     <LINK rel="stylesheet" type="text/css" href="css/default.css"/>
     <LINK rel="stylesheet" type="text/css" href="css/jt_DialogBox.css"/>
     <script type="text/javascript" src="js/jt_DialogBox.js"></script>
   	 <script type="text/javascript" src="js/MyApp_dialogs.js"></script>

   	 <script type="text/javascript" src="js/leilao.js"></script>   
     <script type="text/javascript" src="js/wz_tooltip.js"></script>


<div style="padding-left: 10px; padding-right: 10px; padding-top: 20px;">

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>Durante o
processo de desenvolvimento de um software por demanda, h&aacute; v&aacute;rios
participantes, respons&aacute;veis por diferentes etapas do processo. O processo
utilizado pela Adapit &eacute; uma adapta&ccedil;&atilde;o do processo <i>Scrum</i>, que caracteriza-se
 pelo desenvolvimento &aacute;gil de aplica&ccedil;&otilde;es. O processo
 tem algumas adapta&ccedil;&otilde;es para aplicar o Model Driven Development (MDD) com o WCT.
  O gerente de projetos desenvolve o projeto com
base no guia PMBOK. A nota&ccedil;&atilde;o utilizada para especificar os requisitos
do sistema &eacute; a <i>Unified Modeling Language (UML)</i>.</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>&nbsp;</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>Todo o projeto
da empresa inicia com o analista de neg&oacute;cios. Este avalia o neg&oacute;cio do cliente,
especifica o processo do neg&oacute;cio utilizando ou a UML ou o BPMN. Para determinar
o pre&ccedil;o do sistema &eacute; utilizada An&aacute;lise de Ponto de Fun&ccedil;&atilde;o.
 Em caso de acerto do sistema para com o cliente, a Adapit
ir&aacute; iniciar o processo de desenvolvimento. O gerente de projetos ir&aacute; elaborar o
escopo do projeto. O mesmo far&aacute; a comunica&ccedil;&atilde;o com os demais perfis, dentre eles
o arquiteto de sistemas, o analista de sistemas e o projetista. Para estes tr&ecirc;s perfis o
WCT possibilita maximizar a produtividade, reduzindo custos operacionais da Adapit.</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>&nbsp;</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>O arquiteto
dos sistemas utiliza a WCT para configurar o ambiente no qual o sistema do
cliente ser&aacute; desenvolvido. Esta configura&ccedil;&atilde;o ocorre dentro do WCT e dita quais
as tecnologias ser&atilde;o utilizadas para transformar um modelo de entrada em c&oacute;digo
fonte da aplica&ccedil;&atilde;o. Assim, o arquiteto define uma m&aacute;quina que ir&aacute; automatizar a
produ&ccedil;&atilde;o do sistema do cliente. Isto &eacute; conhecido como Model Driven Engineering
(MDE) que faz uma mescla com arquiteturas para linhas de produto (Product Line Architectures PLA).</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>&nbsp;</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>O analista de
sistemas ir&aacute; utilizar o WCT para automatizar parte do seu trabalho. Ele utiliza
o Desenvolvimento Dirigido por Modelos (MDD e MDA) para transformar os
requisitos do cliente em artefatos de software interpret&aacute;veis pelo WCT. Al&eacute;m
disso, o analista utiliza o WCT para gerar modelos de software automaticamente.</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>&nbsp;</p>

<p class=MsoNormal style='text-align:justify;text-indent:35.4pt'>A cada duas semanas
uma vers&atilde;o do sistema &eacute; apresentada para o cliente. Cada vers&atilde;o &eacute; desenvolvida por
programadores de sistemas qualificados. Tais programadores desenvolvem os recursos
que n&atilde;o foram poss&iacute;veis de serem gerados automaticamente pela WCT nas etapas de 
an&aacute;lise e projeto. Cada vers&atilde;o &eacute; testada iternamente e em conjunto com o cliente
dos sistemas.</p>
<p class=MsoNormal>&nbsp;</p>

</div>